tests/_files/abc.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:try="http://localhost/tryout/">
   <soap:Header/>
   <soap:Body>
      <try:abc>
         <b>B</b>
      </try:abc>
   </soap:Body>
</soap:Envelope>