tests/_files/hello.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:try="http://localhost/tryout/">
   <soap:Header/>
   <soap:Body>
      <try:hello>
         <sign>!</sign>
      </try:hello>
   </soap:Body>
</soap:Envelope>